# **Merging**
- Merging in pandas means combining rows from two DataFrames where the values of one or more columns match (like joining two tables in a relational database).
- It is the process of combining two DataFrames based on common columns or indices — similar to SQL joins (INNER, LEFT, RIGHT, OUTER).
- It allows you to bring data together from different tables using keys.<br>
### **Key Points:**
- Works like SQL JOIN.
- Combines rows based on matching column values (keys).
- Used when you want to relate data across DataFrames.

**Syntax:** <br>
pd.merge(left_dataframe, right_dataframe, how='type_of_join', on=Common_column_which_checks, left_on=None, right_on=None)

In [27]:
import pandas as pd

employees = pd.DataFrame({
    'EmpID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'DeptID': [10, 20, 10, 30]
})

departments = pd.DataFrame({
    'DeptID': [10, 20],
    'DepartmentName': ['HR', 'IT']
})

## **Types  of join**
#### 1. **inner join:** Keep only matching rows (default)

In [28]:
merged_data = pd.merge(employees, departments, how="inner", on="DeptID")
print("inner join")
merged_data

inner join

   EmpID     Name  DeptID DepartmentName
0    101    Alice      10             HR
1    102      Bob      20             IT
2    103  Charlie      10             HR

#### 2. **outer join:** Keep all rows from both sides (fill missing with NaN)

In [29]:
merged_data = pd.merge(employees, departments, how="outer", on="DeptID")
print("outer join")
merged_data

outer join

   EmpID     Name  DeptID DepartmentName
0    101    Alice      10             HR
1    103  Charlie      10             HR
2    102      Bob      20             IT
3    104    David      30            NaN

#### 3. **left join:** Keep all rows from left, match from right

In [30]:
merged_data = pd.merge(departments, employees, how="left", on="DeptID")
print("left join")
merged_data

left join

   DeptID DepartmentName  EmpID     Name
0      10             HR    101    Alice
1      10             HR    103  Charlie
2      20             IT    102      Bob

#### 4. **right join:** Keep all rows from right, match from left

In [31]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3],
    'CustomerName': ['Ali', 'Sara', 'Umar']
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'CustomerID': [2, 1, 2, 4],
    'Amount': [3000, 2500, 4000, 1000]
})

merged_data = pd.merge(customers, orders, how="right", on="CustomerID")
merged_data

   CustomerID CustomerName  OrderID  Amount
0           2         Sara      101    3000
1           1          Ali      102    2500
2           2         Sara      103    4000
3           4          NaN      104    1000

#### 5. **cross joins:** 
- It combines every row of one DataFrame with every row of another, resulting in a Cartesian product. 
- If df1 has 3 rows and df2 has 4 rows, the result will have 3 × 4 = 12 rows.

In [32]:
students = pd.DataFrame({
    'Student': ['Ali', 'Sara']
})

courses = pd.DataFrame({
    'Course': ['Math', 'Science', 'English']
})

merged_data = students.merge(courses, how="cross")
merged_data

  Student   Course
0     Ali     Math
1     Ali  Science
2     Ali  English
3    Sara     Math
4    Sara  Science
5    Sara  English

### **Summary Table**
| Merge Type | Left-only | Right-only | Both sides matched | All Combinations |
| ---------- | --------- | ---------- | ------------------ | ---------------- |
| `inner`    | ❌         | ❌          | ✅                  | ❌                |
| `left`     | ✅         | ❌          | ✅                  | ❌                |
| `right`    | ❌         | ✅          | ✅                  | ❌                |
| `outer`    | ✅         | ✅          | ✅                  | ❌                |
| `cross`    | ❌         | ❌          | ❌                  | ✅                |

## **Practice Questions**

In [33]:
# Employee details: ID, Name, Department
employee_data = pd.DataFrame({
    "ID": [101, 102, 103, 104],
    "Name": ["Ali", "Sara", "Ahmed", "Zara"],
    "Department": ["HR", "Finance", "IT", "Marketing"]
})

# Salary details: ID, Salary
salary_data = pd.DataFrame({
    "ID": [101, 103, 104, 105],
    "Salary": [50000, 70000, 60000, 55000]
})

merged_data = pd.merge(employee_data, salary_data, how="inner", on="ID")
merged_data

    ID   Name Department  Salary
0  101    Ali         HR   50000
1  103  Ahmed         IT   70000
2  104   Zara  Marketing   60000

### 1. Merge on Multiple Keys

In [34]:
# Merge both DataFrames on City and Year to find the manager for each employee's city during their joining year.
df_employees = pd.DataFrame({
    "Emp_ID": [201, 202, 203, 204, 205],
    "Name": ["Ali", "Zara", "Ahmed", "Sara", "Bilal"],
    "City": ["Lahore", "Karachi", "Lahore", "Islamabad", "Karachi"],
    "Year": [2020, 2021, 2021, 2020, 2022]
})

df_branches = pd.DataFrame({
    "City": ["Lahore", "Lahore", "Karachi", "Islamabad", "Karachi"],
    "Year": [2020, 2021, 2021, 2020, 2022],
    "Branch_Manager": ["Mr. Khan", "Ms. Fatima", "Mr. Ali", "Ms. Noor", "Mr. Kamran"]
})

merged_on_city_year = pd.merge(df_employees, df_branches, on=["Year","City"], how="inner")
merged_on_city_year

   Emp_ID   Name       City  Year Branch_Manager
0     201    Ali     Lahore  2020       Mr. Khan
1     202   Zara    Karachi  2021        Mr. Ali
2     203  Ahmed     Lahore  2021     Ms. Fatima
3     204   Sara  Islamabad  2020       Ms. Noor
4     205  Bilal    Karachi  2022     Mr. Kamran

### 2. Merge with Aggregation

In [49]:
# Merge both and calculate total spending per customer. Then display only customers who spent more than 50,000.
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3,7],
    'CustomerName': ['Ali', 'Sara', 'Umar', "Shahid"]
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104,105],
    'CustomerID': [2, 1, 2, 4,7],
    'Amount': [3000, 2500, 4000, 1000, 6000]
})

merged_data = pd.merge(customers, orders, on="CustomerID", how="inner")
print(merged_data)
total_spending_per_customer = merged_data.groupby(["CustomerID", "CustomerName"])["Amount"].sum().reset_index()
amount_greater_than_5000 = total_spending_per_customer[total_spending_per_customer["Amount"] > 5000]
amount_greater_than_5000

   CustomerID CustomerName  OrderID  Amount
0           1          Ali      102    2500
1           2         Sara      101    3000
2           2         Sara      103    4000
3           7       Shahid      105    6000

   CustomerID CustomerName  Amount
1           2         Sara    7000
2           7       Shahid    6000